"""Calculations texts."""


START = 'Расчет стоимости позиций'

BACK_TO_MENU = '🔙 Вернуться в меню'

ADD_ITEM = 'Добавить позицию'

ARTICLE_SELECT = 'Выберите позицию или введите наименование и пошлину в ручную'

ARTICLE_MANUAL_INPUT = 'Ввести данные в ручную'

ASK_NAME = 'Укажите наименование позиции:'

ASK_DUTY_FEE_RATIO = 'Укажите пошлину на позицию (например, "9.5" для наценки в 9.5%):'  # noqa: E501

BAD_DUTY_FEE_RATIO = 'Неверный формат. Пошлина должна быть числом, например, например, "9.5" для наценки в 9.5%. Попробуйте снова'   # noqa: E501
